2017-10-08-Using-bookmarks-with-eshell-and-docker-tramp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-08 Sun 12:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using bookmarks with eshell and docker-tramp</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matúš Goljer" />
<link rel="stylesheet" href="css/blog.css" />
</head>
<body>
<div id="preamble" class="status">

<div style="text-align: left; float: left;">
  <a href="./sitemap.html">Home</a>
  <a href="https://github.com/Fuco1/">GitHub</a>
  <a href="https://www.patreon.com/user?u=3282358">Patreon</a>
</div>
<div style="text-align: right;">
  <a href="https://fuco1.github.io/rss.xml">RSS</a>
  <a href="https://twitter.com/Fuco1337">Twitter</a>
</div>
<hr />
</div>
<div id="content">
<h1 class="title">Using bookmarks with eshell and docker-tramp</h1>

<p>
Emacs comes with a pretty extensible bookmarking system.  As expected,
you can bookmark files (including positions in the file!) in order to
quickly navigate to commonly used files.  I use this for my config
files, personal/gdt org files, my ledger file and so on.
</p>

<p>
Thanks to the Emacs philosophy of everything being a buffer you can
also bookmark a plethora of special buffers such as email buffers,
elfeed entries, info pages, help pages, dired buffers and many more.
Pretty much any buffer which can be reconstructed from a set of input
arguments can be bookmarked.
</p>

<p>
As a bonus it all works through the same interface, by default bound
to <code>C-x r m</code>, so you can just hit that to see if the buffer's type is
supported or not.
</p>

<p>
Adding support for new buffers is also amazingly simple.  All you need
to do is define a function which makes a bookmark <i>record</i>.  A bookmark
record is simply an alist with arbitrary data.  You can save any state
there that is necessary for the recreation of the buffer.  The only
required key is <code>handler</code> which has a function as a value.  This
function is given the entire bookmark record and is responsible for
recreating the buffer.
</p>

<p>
You then locally assign (with <code>setq-local</code>) this record creating
function to <code>bookmark-make-record-function</code> which is internally used by
<code>bookmark.el</code> when you ask it to create a record.
</p>

<p>
Recently I've been using <a href="https://www.docker.com/">docker</a> (especially <a href="https://docs.docker.com/compose/">docker-compose</a>) a lot and
one thing that comes up fairly often during development is that you
might want to execute some commands inside the container (for example
when you are using the <a href="https://medium.com/@alexeiled/docker-pattern-the-build-container-b0d0e86ad601">build container pattern</a>).
</p>

<p>
What bothered me was the fact that I had to leave Emacs, jump to the
terminal and fire away the commands in there.  Turns out someone
clever figured out a way of using TRAMP<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup> to connect into docker
containers.  Combined with this, I can use eshell to jump into docker
container and execute commands in there.  Whoa!
</p>

<pre class="example">
[12:15:50]:~/$ docker ps
CONTAINER ID        IMAGE                 NAMES
e015daa0ceac        fuco1/zathura:0.3.7   focused_hugle
[12:15:52]:~/$ cd /docker:focused_hugle:/
[12:17:01]:/docker:focused_hugle:$ ls
bin   etc     lib    mnt   root  srv  usr      zathura-cb           zathura-ps
boot  girara  lib64  opt   run   sys  var      zathura-djvu
dev   home    media  proc  sbin  tmp  zathura  zathura-pdf-poppler
</pre>

<p>
To tie all of this together I've written a small package
<a href="https://github.com/Fuco1/eshell-bookmark">eshell-bookmark</a><sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
which adds bookmark support to eshell buffers.  More specifically,
when the bookmark is activated it tries to open an eshell in the
directory where the bookmark was created.  If an eshell session
already exists, it just =cd=s into that directory.  The entire package
is less than 30 lines including docstrings.  This is really the ideal
of extensibility.
</p>

<p>
Thanks to <code>docker-compose</code> containers having predictable names, I can
now bookmark each container's eshell session and quickly jump between
them as necessary, all from within Emacs.  No more <code>$ docker-compose
exec application ...</code>!
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara">The
package <a href="https://github.com/emacs-pe/docker-tramp.el">docker-tramp.el</a> is available on MELPA</div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara">Now available on MELPA/Stable</div></div>


</div>
</div></div>
<div id="postamble" class="status">
<hr />
<div style="text-align: left; float: left;">Last updated at: 2017-10-08 12:25</div>
<div style="text-align: right;">Found a typo? <a href="https://github.com/Fuco1/fuco1.github.io/blob/master/posts/2017-10-08-Using-bookmarks-with-eshell-and-docker-tramp.org">Edit on GitHub!</a></div>
</div>
</body>
</html>
